/* BizSimAI - English Localization */

/* Common */
"app.name" = "BizSimAI";
"common.login" = "Login";
"common.logout" = "Logout";
"common.save" = "Save";
"common.cancel" = "Cancel";
"common.error" = "Error";
"common.loading" = "Loading...";
"common.success" = "Success";
"common.retry" = "Retry";
"common.submit" = "Submit";
"common.back" = "Back";
"common.done" = "Done";
"common.delete" = "Delete";
"common.edit" = "Edit";
"common.close" = "Close";

/* Authentication */
"auth.professor_login" = "Professor Login";
"auth.student_access" = "Student Access";
"auth.username" = "Username";
"auth.password" = "Password";
"auth.student_id" = "Student ID";
"auth.full_name" = "Full Name";
"auth.team_name" = "Team Name";
"auth.register" = "Register & Join";
"auth.sign_in_apple" = "Sign in with Apple";
"auth.sign_in_google" = "Sign in with Google";
"auth.session_expired" = "Session expired. Please log in again.";

/* Session */
"session.create" = "Create Session";
"session.join" = "Join Session";
"session.code" = "Session Code";
"session.round" = "Round %d of %d";
"session.status_waiting" = "Waiting for Players";
"session.status_active" = "In Progress";
"session.status_completed" = "Completed";
"session.end" = "End Session";
"session.delete" = "Delete Session";

/* Decisions */
"decision.submit" = "Submit Decisions";
"decision.submitted" = "Decisions Submitted";
"decision.over_budget" = "Over budget";
"decision.invalid" = "Invalid decisions";

/* Results */
"results.leaderboard" = "Leaderboard";
"results.profit" = "Profit";
"results.revenue" = "Revenue";
"results.market_share" = "Market Share";
"results.stock_price" = "Stock Price";
"results.cumulative" = "Cumulative";

/* Sync */
"sync.online" = "Online";
"sync.offline" = "Offline";
"sync.syncing" = "Syncing...";
"sync.error" = "Sync failed";
"sync.saved_locally" = "Saved locally";

/* Professor */
"prof.dashboard" = "Dashboard";
"prof.sessions" = "Sessions";
"prof.analytics" = "Analytics";
"prof.announcements" = "Announcements";
"prof.grade_mapping" = "Grade Mapping";

/* Student */
"student.team_dashboard" = "Team Dashboard";
"student.ai_coach" = "AI Coach";
"student.performance" = "Performance";

/* Navigation */
"nav.home" = "Home";
"nav.settings" = "Settings";
"nav.profile" = "Profile";
"nav.help" = "Help";

/* Errors */
"error.network" = "Network error. Please check your connection.";
"error.server" = "Server error. Please try again later.";
"error.unauthorized" = "Unauthorized. Please log in again.";
"error.not_found" = "Resource not found.";
